import os
import configparser
print(
    "        ░▐█▀▀─░▄█▀▄─░▐█▀█░▐█▀▀▒▄█▀▀█\n"
    "        ░▐█▀▀░▐█▄▄▐█░▐█──░▐█▀▀▒▀▀█▄▄\n"
    "        ░▐█──░▐█─░▐█░▐█▄█░▐█▄▄▒█▄▄█▀\n"
    "            |██████████░██████████|\n"
    "            |░███████████████████░|\n"
    "            |░░███████░░░███████░░|\n"
    "            |░░░█████░░░░░█████░░░|\n"
    "            |░░░░░░░░░░░░░░░░░░░░░|\n"
    "            |█░░░░░░░░░░░░░░░░░░░█|\n"
    "            |█░░░░░█████████░░░░░█|\n"
    "            |██░░█████░░░█████░░██|\n"
    "            |█████░░░░░░░░░░░█████|\n"
    "            |██████░░░░█░░░░██████|\n"
    "            |░███████████████████░|\n"
    "            |░███████████████████░|\n"
    "            |░░█████████████████░░|\n"
    "            |░░░███████████████░░░|\n"
    "            |░░░░█████████████░░░░|\n"
    "            |░░░░░░░░█████░░░░░░░░|\n"
    "░▐█▀█▄░▐█▀▀▒█▀█▀█░▐█▀▀░▐█▀█▒█▀█▀█▒▐█▀▀█▌▒▐█▀▀▄\n"
    "░▐█▌▐█░▐█▀▀░░▒█░░░▐█▀▀░▐█──░░▒█░░▒▐█▄▒█▌▒▐█▒▐█\n"
    "░▐█▄█▀░▐█▄▄░▒▄█▄░░▐█▄▄░▐█▄█░▒▄█▄░▒▐██▄█▌▒▐█▀▄▄\n"
    "----------------------------------------------\n"
    "О программе: для работы с видеофайлами необходимо нажать '1',\n"
    "затем ввести имя видеофайла, после загрузки обработанное видео\n"
    "будет добавленно в директорию 'video'. Для работы с веб-камерами\n"
    "необходимо нажать '2', для выхода из окна необходимо нажать 'q',\n"
    "для включения необходимо нажать 'b', чтобы сохранить изображение\n"
    "нужно нажать 'ctrl+s', копировать-'ctrl+c',\n"
    "приблизить/отдалить-колесо мыши или 'ctrl++'/'ctrl+-'.\n"
    "Для завершения работы нажмите '0'.\n"
    "-----------------------------------\n"
    "Введите команду: "
)
# Подключаем config-файл
config = configparser.ConfigParser()
config.read("settings.ini")
while True:
    key = int(input())
    if key == 1:
        os.system(config["settings"]["KEY_1"])
    if key == 2:
        os.system(config["settings"]["KEY_2"])
    if key == 0:
        exit()
